{"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 662], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAEwAAAHMUAAAAfABkAGQAhQKIAGQAhQJmAhkAUwCpAU6pAKkB\n2gF0qQHaBGRvY3NyAgAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0cy9tcmkv\nc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4nAAAA8wAAAAA=\n", null, [65]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": [597], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAEwAAAHMUAAAAfABkAGQAhQJkAIgAhQJmAhkAUwCpAU6pAKkB\n2gF0qQHaBGRvY3NyAgAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0cy9tcmkv\nc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4kAAAA8wAAAAA=\n", null, [65]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": [65], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_2", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_3", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_4", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_5", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_5", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_6", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_6", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_7", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_7", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_8", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_8", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_9", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_9", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_10", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_10", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_11", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_11", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_12", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_12", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_13", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_13", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_14", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_14", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_15", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_15", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_16", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_16", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_17", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_17", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_18", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_18", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_19", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_19", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_20", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_20", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_21", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_21", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_22", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_22", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_23", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_23", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_24", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_24", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_25", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_25", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_26", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_26", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_27", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_27", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_28", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_28", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_29", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_29", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_30", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_30", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_31", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_31", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_32", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_32", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_33", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_33", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_34", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_34", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_35", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_35", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_36", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_36", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_37", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_37", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_38", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_38", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_39", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_39", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_40", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_40", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_41", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_41", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_42", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_42", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_43", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_43", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_44", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_44", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_45", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_45", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_46", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_46", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_47", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_47", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_48", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_48", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_49", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_49", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_50", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_50", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_51", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_51", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_52", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_52", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_53", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_53", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_54", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_54", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_55", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_55", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_56", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_56", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_57", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_57", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_58", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_58", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_59", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_59", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_60", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_60", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_61", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_61", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_62", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_62", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_63", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_63", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_64", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_64", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_65", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_65", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_66", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_66", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_67", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_67", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_68", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_68", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_69", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_69", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_70", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_70", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_71", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_71", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_72", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_72", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_73", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_73", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_74", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_74", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_75", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_75", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_76", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_76", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_77", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_77", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_78", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_78", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_79", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_79", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_80", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_80", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_81", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_81", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_82", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMYAAAAfABkAGQAhQKIAIgAZAEXAIUCZgIZAFMAqQJO\n6QEAAACpAKkB2gF0KQHaAWlyAwAAAPpJQzovVXNlcnMvYWRyaWFuL0RvY3VtZW50cy9Qcm9qZWN0\ncy9tcmkvc2VydmVyL2VuZ2luZXMvcmFua2luZy9ubl9tb2RlbC5wedoIPGxhbWJkYT4wAAAA8wAA\nAAA=\n", null, [596]], "function_type": "lambda", "module": "engines.ranking.nn_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_82", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_83", "trainable": true, "dtype": "float32", "function": 